# SolidGeometryOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidGeometryOptions Constructor
SolidGeometryOptions Class See Also
---
Creates a new SolidOptions class with solid tag settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public SolidGeometryOptions(
	int solidTag
)
```

Visual Basic
---
```text
Public Sub New ( _
	solidTag As Integer _
)
```

Visual C++
---
```text
public:
SolidGeometryOptions(
	int solidTag
)
```

# ### Parameters
solidTag
    Type: System..::..Int32 The material id for the Solid.
# See Also
SolidGeometryOptions Class
Autodesk.Revit.DB Namespace